In [2]:
import numpy as np
import pandas as pd

# DataFrames 

bunch of Series objects having a common index.

In [3]:
from numpy.random import randn
np.random.seed(50)

In [4]:
df = pd.DataFrame(randn(5,4),
            index = 'A B C D E'.split(),
            columns = 'W X Y Z'.split())

In [5]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

# Selection and Indexing 

### Selecting Columns

In [6]:
df['Y']

A   -0.620928
B   -0.780469
C    0.126338
D   -0.997526
E    0.123866
Name: Y, dtype: float64

In [7]:
df.Y

A   -0.620928
B   -0.780469
C    0.126338
D   -0.997526
E    0.123866
Name: Y, dtype: float64

In [8]:
type(df['Y'])

pandas.core.series.Series

In [9]:
df['new'] = df['W']+df['Y']

In [10]:
df

          W         X         Y         Z       new
A -1.560352 -0.030978 -0.620928 -1.464580 -2.181281
B  1.411946 -0.476732 -0.780469  1.070268  0.631477
C -1.282293 -1.327479  0.126338  0.862194 -1.155955
D  0.696737 -0.334565 -0.997526  1.598908 -0.300789
E  3.314075  0.987770  0.123866  0.742785  3.437942

In [11]:
#removing columns

In [12]:
df

          W         X         Y         Z       new
A -1.560352 -0.030978 -0.620928 -1.464580 -2.181281
B  1.411946 -0.476732 -0.780469  1.070268  0.631477
C -1.282293 -1.327479  0.126338  0.862194 -1.155955
D  0.696737 -0.334565 -0.997526  1.598908 -0.300789
E  3.314075  0.987770  0.123866  0.742785  3.437942

In [13]:
df1 = df.drop('new',axis = 1)

In [14]:
df1

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [15]:
df

          W         X         Y         Z       new
A -1.560352 -0.030978 -0.620928 -1.464580 -2.181281
B  1.411946 -0.476732 -0.780469  1.070268  0.631477
C -1.282293 -1.327479  0.126338  0.862194 -1.155955
D  0.696737 -0.334565 -0.997526  1.598908 -0.300789
E  3.314075  0.987770  0.123866  0.742785  3.437942

In [16]:
#methdo2
df.drop('new',axis = 1, inplace = True)

In [17]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

# Selecting Rows

In [18]:
df.loc['B']

W    1.411946
X   -0.476732
Y   -0.780469
Z    1.070268
Name: B, dtype: float64

In [19]:
df.iloc[0]

W   -1.560352
X   -0.030978
Y   -0.620928
Z   -1.464580
Name: A, dtype: float64

# Conditional Selection

In [20]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [21]:
df > 0

       W      X      Y      Z
A  False  False  False  False
B   True  False  False   True
C  False  False   True   True
D   True  False  False   True
E   True   True   True   True

In [22]:
df[df>0] #not common to use.

          W        X         Y         Z
A       NaN      NaN       NaN       NaN
B  1.411946      NaN       NaN  1.070268
C       NaN      NaN  0.126338  0.862194
D  0.696737      NaN       NaN  1.598908
E  3.314075  0.98777  0.123866  0.742785

In [23]:
df['X']>0

A    False
B    False
C    False
D    False
E     True
Name: X, dtype: bool

In [24]:
df['X']

A   -0.030978
B   -0.476732
C   -1.327479
D   -0.334565
E    0.987770
Name: X, dtype: float64

In [25]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [26]:
df[df['X']<0]

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908

In [27]:
df['X']

A   -0.030978
B   -0.476732
C   -1.327479
D   -0.334565
E    0.987770
Name: X, dtype: float64

In [28]:
df['X']>0

A    False
B    False
C    False
D    False
E     True
Name: X, dtype: bool

In [29]:
df[(df['W']> 0)|(df['Y']>0)]

          W         X         Y         Z
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

# More Index Concepts:

In [30]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [31]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.560352 -0.030978 -0.620928 -1.464580
1     B  1.411946 -0.476732 -0.780469  1.070268
2     C -1.282293 -1.327479  0.126338  0.862194
3     D  0.696737 -0.334565 -0.997526  1.598908
4     E  3.314075  0.987770  0.123866  0.742785

In [32]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [33]:
df.reset_index(inplace = True)

In [34]:
df

  index         W         X         Y         Z
0     A -1.560352 -0.030978 -0.620928 -1.464580
1     B  1.411946 -0.476732 -0.780469  1.070268
2     C -1.282293 -1.327479  0.126338  0.862194
3     D  0.696737 -0.334565 -0.997526  1.598908
4     E  3.314075  0.987770  0.123866  0.742785

# Setting Index

In [35]:
st = 'TN MP WB UP GJ'.split()

In [36]:
df['states'] = st

# df['states'] = 'TN MP WB UP GJ'.split()

In [37]:
df

  index         W         X         Y         Z states
0     A -1.560352 -0.030978 -0.620928 -1.464580     TN
1     B  1.411946 -0.476732 -0.780469  1.070268     MP
2     C -1.282293 -1.327479  0.126338  0.862194     WB
3     D  0.696737 -0.334565 -0.997526  1.598908     UP
4     E  3.314075  0.987770  0.123866  0.742785     GJ

In [38]:
df.set_index('states')

       index         W         X         Y         Z
states
TN         A -1.560352 -0.030978 -0.620928 -1.464580
MP         B  1.411946 -0.476732 -0.780469  1.070268
WB         C -1.282293 -1.327479  0.126338  0.862194
UP         D  0.696737 -0.334565 -0.997526  1.598908
GJ         E  3.314075  0.987770  0.123866  0.742785

In [39]:
df

  index         W         X         Y         Z states
0     A -1.560352 -0.030978 -0.620928 -1.464580     TN
1     B  1.411946 -0.476732 -0.780469  1.070268     MP
2     C -1.282293 -1.327479  0.126338  0.862194     WB
3     D  0.696737 -0.334565 -0.997526  1.598908     UP
4     E  3.314075  0.987770  0.123866  0.742785     GJ

In [40]:
df.set_index('states',inplace=True)

In [41]:
df

       index         W         X         Y         Z
states
TN         A -1.560352 -0.030978 -0.620928 -1.464580
MP         B  1.411946 -0.476732 -0.780469  1.070268
WB         C -1.282293 -1.327479  0.126338  0.862194
UP         D  0.696737 -0.334565 -0.997526  1.598908
GJ         E  3.314075  0.987770  0.123866  0.742785

# Multi-Index and Index Hierarchy

In [42]:
outside = 'A1 A1 A1 A2 A2 A2'.split()

In [43]:
inside = [ 11,12,13,11,12,13]

hier_index = list(zip(outside, inside))


hier_index = pd.MultiIndex.from_tuples(hier_index)

In [44]:
hier_index

MultiIndex([('A1', 11),
            ('A1', 12),
            ('A1', 13),
            ('A2', 11),
            ('A2', 12),
            ('A2', 13)],
           )

In [45]:
new_df = pd.DataFrame(index=hier_index, data = np.random.randn(6,2), columns = ['X','Y'])

In [46]:
new_df

              X         Y
A1 11 -0.393956  0.148116
   12 -0.412234 -0.160715
   13  0.139531  0.285469
A2 11 -0.281262  1.710907
   12 -0.149767  0.690307
   13  1.095210  1.338409

In [47]:
new_df.loc['A1']

           X         Y
11 -0.393956  0.148116
12 -0.412234 -0.160715
13  0.139531  0.285469

In [48]:
new_df.loc['A1'].loc[12,'Y']

-0.1607150610108811

In [49]:
new_df.index.names

FrozenList([None, None])

In [50]:
new_df.index.names = ['Group','Roll No']

In [51]:
new_df

                      X         Y
Group Roll No
A1    11      -0.393956  0.148116
      12      -0.412234 -0.160715
      13       0.139531  0.285469
A2    11      -0.281262  1.710907
      12      -0.149767  0.690307
      13       1.095210  1.338409

# Missing Data

NAN: Not a Number

In [52]:
import numpy as np 
import pandas as pd

In [53]:
df_1=pd.DataFrame({'A':[1,4,np.nan, 9],
              'B':[3,np.nan,1,np.nan],
              'C':[6,7,8,9],
              'D':['Pass',np.nan,np.nan,'Fail']})

In [54]:
df_1

     A    B  C     D
0  1.0  3.0  6  Pass
1  4.0  NaN  7   NaN
2  NaN  1.0  8   NaN
3  9.0  NaN  9  Fail

In [55]:
df_1.dropna() #default values of axis is 0

     A    B  C     D
0  1.0  3.0  6  Pass

In [56]:
df_1.dropna(axis=1)

   C
0  6
1  7
2  8
3  9

In [57]:
df_1

     A    B  C     D
0  1.0  3.0  6  Pass
1  4.0  NaN  7   NaN
2  NaN  1.0  8   NaN
3  9.0  NaN  9  Fail

In [58]:
df_1.dropna(thresh = 3)

     A    B  C     D
0  1.0  3.0  6  Pass
3  9.0  NaN  9  Fail

In [59]:
df_1.dropna(thresh = 4)

     A    B  C     D
0  1.0  3.0  6  Pass

Thresh gives me the number of values that are not NaN

In the provided code, the thresh parameter is used with the dropna method of a pandas DataFrame to control the number of non-null values required in each row (or column) to keep that row (or column) in the DataFrame. It specifies the minimum number of non-null values that a row must have to be retained after the operation.

In [60]:
df_1.fillna(value = 'Missing Value')

               A              B  C              D
0            1.0            3.0  6           Pass
1            4.0  Missing Value  7  Missing Value
2  Missing Value            1.0  8  Missing Value
3            9.0  Missing Value  9           Fail

In [61]:
df_1['A'].fillna(0)

0    1.0
1    4.0
2    0.0
3    9.0
Name: A, dtype: float64

In [62]:
df_1

     A    B  C     D
0  1.0  3.0  6  Pass
1  4.0  NaN  7   NaN
2  NaN  1.0  8   NaN
3  9.0  NaN  9  Fail

In [63]:
df_1.fillna({'A':2,
           'B':'Nothing'})

     A        B  C     D
0  1.0      3.0  6  Pass
1  4.0  Nothing  7   NaN
2  2.0      1.0  8   NaN
3  9.0  Nothing  9  Fail

In [64]:
df_1

     A    B  C     D
0  1.0  3.0  6  Pass
1  4.0  NaN  7   NaN
2  NaN  1.0  8   NaN
3  9.0  NaN  9  Fail

In [70]:
df_1['A'].fillna(value=df_1['C'].mean())

0    1.0
1    4.0
2    7.5
3    9.0
Name: A, dtype: float64

In [66]:
df_1.fillna(method = 'ffill')

     A    B  C     D
0  1.0  3.0  6  Pass
1  4.0  3.0  7  Pass
2  4.0  1.0  8  Pass
3  9.0  1.0  9  Fail

In [67]:
df_1.fillna(method = 'bfill')

     A    B  C     D
0  1.0  3.0  6  Pass
1  4.0  1.0  7  Fail
2  9.0  1.0  8  Fail
3  9.0  NaN  9  Fail

In [68]:
df_1.interpolate()

     A    B  C     D
0  1.0  3.0  6  Pass
1  4.0  2.0  7   NaN
2  6.5  1.0  8   NaN
3  9.0  1.0  9  Fail

# Special Values

In [71]:
df3 = pd.DataFrame({'A':[1,2,np.nan,7777],
                   'B':[3,np.nan,1,np.nan],
                   'C':[6,7,9999,9],
                   'D':['Pass',np.nan,np.nan,'Fail']})

In [72]:
df3

        A    B     C     D
0     1.0  3.0     6  Pass
1     2.0  NaN     7   NaN
2     NaN  1.0  9999   NaN
3  7777.0  NaN     9  Fail

In [73]:
df3.replace(9999,np.nan)

        A    B    C     D
0     1.0  3.0  6.0  Pass
1     2.0  NaN  7.0   NaN
2     NaN  1.0  NaN   NaN
3  7777.0  NaN  9.0  Fail

In [74]:
df3.replace([9999,7777],np.nan)

     A    B    C     D
0  1.0  3.0  6.0  Pass
1  2.0  NaN  7.0   NaN
2  NaN  1.0  NaN   NaN
3  NaN  NaN  9.0  Fail

In [93]:
df4 = df3.replace(7777,'Pass')
df4

      A    B     C     D
0   1.0  3.0     6  Pass
1   2.0  NaN     7   NaN
2   NaN  1.0  9999   NaN
3  Pass  NaN     9  Fail

In [76]:
df4.replace({'A':'Pass'},9)

     A    B     C     D
0  1.0  3.0     6  Pass
1  2.0  NaN     7   NaN
2  NaN  1.0  9999   NaN
3  9.0  NaN     9  Fail

In [77]:
df4.replace({'A':'Pass','C':9999},np.nan)

     A    B    C     D
0  1.0  3.0  6.0  Pass
1  2.0  NaN  7.0   NaN
2  NaN  1.0  NaN   NaN
3  NaN  NaN  9.0  Fail

In [94]:
df4.replace(df4['C']>6, 0)

      A    B     C     D
0   1.0  3.0     6  Pass
1   2.0  NaN     7   NaN
2   NaN  1.0  9999   NaN
3  Pass  NaN     9  Fail

In [95]:
df4

      A    B     C     D
0   1.0  3.0     6  Pass
1   2.0  NaN     7   NaN
2   NaN  1.0  9999   NaN
3  Pass  NaN     9  Fail

In [96]:
df4.loc[df4['C'] > 7, 'C'] = 0
df4

      A    B  C     D
0   1.0  3.0  6  Pass
1   2.0  NaN  7   NaN
2   NaN  1.0  0   NaN
3  Pass  NaN  0  Fail

In [103]:
df4.replace({'D':'Fail',
             'B':np.nan,
             'C':0},5)

      A    B  C     D
0   1.0  3.0  6  Pass
1   2.0  5.0  7   NaN
2   NaN  1.0  5   NaN
3  Pass  5.0  5     5

In [100]:
#Replace Entire List

st = pd.DataFrame({'name':['riya','mia','neha','swati'],
              'score':['E','P','P','A']})

In [101]:
st.replace(['E','P','A'],['Excellent','Poor','Average'])

    name      score
0   riya  Excellent
1    mia       Poor
2   neha       Poor
3  swati    Average